Tekla.Structures.ModelInternal.PropertySetDefinition
Represents a Property Set Definition data class.

Tekla.Structures.ModelInternal.PropertySetDefinition.Id
The PropertySetDefinition identifier

Tekla.Structures.ModelInternal.PropertySetDefinition.LibraryId
The PropertySetLibrary library identifier

Tekla.Structures.ModelInternal.PropertySetDefinition.Name
The PropertySetDefinition name

Tekla.Structures.ModelInternal.PropertySetDefinition.Version
The PropertySetDefinition version

Tekla.Structures.ModelInternal.PropertySetDefinition.ChangeToken
The change token for the PropertySetDefinition